; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph3 - mode
	infrared2 - mode
	spectrograph1 - mode
	thermograph0 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Planet3 - direction
	Planet4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 112)
	(= (data Planet3 thermograph3) 97)
	(= (data Planet4 thermograph3) 180)
	(= (data Star5 thermograph3) 204)
	(= (data Phenomenon6 thermograph3) 216)
	(= (data Phenomenon7 thermograph3) 58)
	(= (data Planet3 infrared2) 183)
	(= (data Planet4 infrared2) 134)
	(= (data Star5 infrared2) 127)
	(= (data Phenomenon6 infrared2) 140)
	(= (data Phenomenon7 infrared2) 75)
	(= (data Planet3 spectrograph1) 188)
	(= (data Planet4 spectrograph1) 3)
	(= (data Star5 spectrograph1) 168)
	(= (data Phenomenon6 spectrograph1) 59)
	(= (data Phenomenon7 spectrograph1) 160)
	(= (data Planet3 thermograph0) 86)
	(= (data Planet4 thermograph0) 47)
	(= (data Star5 thermograph0) 213)
	(= (data Phenomenon6 thermograph0) 197)
	(= (data Phenomenon7 thermograph0) 283)
	(= (slew_time Star1 Star0) 10.65)
	(= (slew_time Star0 Star1) 10.65)
	(= (slew_time Star2 Star0) 66.55)
	(= (slew_time Star0 Star2) 66.55)
	(= (slew_time Star2 Star1) 9.608)
	(= (slew_time Star1 Star2) 9.608)
	(= (slew_time Planet3 Star0) 9.19)
	(= (slew_time Star0 Planet3) 9.19)
	(= (slew_time Planet3 Star1) 37.65)
	(= (slew_time Star1 Planet3) 37.65)
	(= (slew_time Planet3 Star2) 15.7)
	(= (slew_time Star2 Planet3) 15.7)
	(= (slew_time Planet4 Star0) 12.7)
	(= (slew_time Star0 Planet4) 12.7)
	(= (slew_time Planet4 Star1) 91.08)
	(= (slew_time Star1 Planet4) 91.08)
	(= (slew_time Planet4 Star2) 3.205)
	(= (slew_time Star2 Planet4) 3.205)
	(= (slew_time Planet4 Planet3) 8.228)
	(= (slew_time Planet3 Planet4) 8.228)
	(= (slew_time Star5 Star0) 45.29)
	(= (slew_time Star0 Star5) 45.29)
	(= (slew_time Star5 Star1) 35.24)
	(= (slew_time Star1 Star5) 35.24)
	(= (slew_time Star5 Star2) 5.213)
	(= (slew_time Star2 Star5) 5.213)
	(= (slew_time Star5 Planet3) 7.032)
	(= (slew_time Planet3 Star5) 7.032)
	(= (slew_time Star5 Planet4) 7.935)
	(= (slew_time Planet4 Star5) 7.935)
	(= (slew_time Phenomenon6 Star0) 24.79)
	(= (slew_time Star0 Phenomenon6) 24.79)
	(= (slew_time Phenomenon6 Star1) 61.07)
	(= (slew_time Star1 Phenomenon6) 61.07)
	(= (slew_time Phenomenon6 Star2) 87.58)
	(= (slew_time Star2 Phenomenon6) 87.58)
	(= (slew_time Phenomenon6 Planet3) 48.11)
	(= (slew_time Planet3 Phenomenon6) 48.11)
	(= (slew_time Phenomenon6 Planet4) 81.23)
	(= (slew_time Planet4 Phenomenon6) 81.23)
	(= (slew_time Phenomenon6 Star5) 25.87)
	(= (slew_time Star5 Phenomenon6) 25.87)
	(= (slew_time Phenomenon7 Star0) 23.79)
	(= (slew_time Star0 Phenomenon7) 23.79)
	(= (slew_time Phenomenon7 Star1) 38.04)
	(= (slew_time Star1 Phenomenon7) 38.04)
	(= (slew_time Phenomenon7 Star2) 24.74)
	(= (slew_time Star2 Phenomenon7) 24.74)
	(= (slew_time Phenomenon7 Planet3) 34.7)
	(= (slew_time Planet3 Phenomenon7) 34.7)
	(= (slew_time Phenomenon7 Planet4) 47.22)
	(= (slew_time Planet4 Phenomenon7) 47.22)
	(= (slew_time Phenomenon7 Star5) 54.23)
	(= (slew_time Star5 Phenomenon7) 54.23)
	(= (slew_time Phenomenon7 Phenomenon6) 10.88)
	(= (slew_time Phenomenon6 Phenomenon7) 10.88)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Planet3 thermograph0)
	(have_image Star5 spectrograph1)
	(have_image Phenomenon7 thermograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
2. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 3
3. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 112 to 106.787, (fuel-used) from 0 to 5.213
   goals met: 0 of 3
4. (take_image satellite0 star5 instrument0 spectrograph1)
   added: (have_image star5 spectrograph1)
   changed: (data_capacity satellite0) from 1000 to 832, (data-stored) from 0 to 168
   goals met: 1 of 3
5. (turn_to satellite0 planet3 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet3)
   changed: (fuel satellite0) from 106.787 to 99.755, (fuel-used) from 5.213 to 12.245
   goals met: 1 of 3
6. (take_image satellite0 planet3 instrument0 thermograph0)
   added: (have_image planet3 thermograph0)
   changed: (data_capacity satellite0) from 832 to 746, (data-stored) from 168 to 254
   goals met: 2 of 3
7. (turn_to satellite0 phenomenon7 planet3)
   deleted: (pointing satellite0 planet3)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 99.755 to 65.055, (fuel-used) from 12.245 to 46.945
   goals met: 2 of 3
8. (take_image satellite0 phenomenon7 instrument0 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   changed: (data_capacity satellite0) from 746 to 463, (data-stored) from 254 to 537
   goals met: 3 of 3
